app/controllers/api/v1/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 155], ["LIMIT", 1]]
---
    def show
        category=Category.find params[:id]

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 155], ["LIMIT", 1]]
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Hair"], ["updated_at", "2019-09-08 08:20:34.777655"], ["id", 155]]
---
    def update
        @category=Category.find params[:id]
        if @category.update(name: params[:name])

INSERT INTO "categories" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Gifts"], ["user_id", 98], ["created_at", "2019-09-08 09:18:20.359243"], ["updated_at", "2019-09-08 09:18:20.359243"]]
---
    def create
        @category = Category.create(category_params)