app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        render json: User.all, each_serializer: UserSerializer, include: '*.*.*'

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
UPDATE "users" SET "income" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["income", 100000], ["updated_at", "2019-09-03 14:11:35.570889"], ["id", 60]]
---
    def update
        @user= User.find params[:id]
        if @user.update(budget: params[:budget].to_i, income: params[:income], goals:params[:goals] )

INSERT INTO "users" ("first_name", "last_name", "email", "income", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @user = User.create(user_params)